---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange.BoltDiameter
source: html/654bc36f-9ff4-d79f-3c68-cdfed7d6a872.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange.BoltDiameter Property

Maximum bolt hole diameter, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameter { get; set; }
```